```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_firebase_android_app.main has been deleted
  - resource "google_firebase_android_app" "main" {
      - app_id          = "1:279861227938:android:8b4e86b064ce7429c502fb" -> null
        id              = "projects/playground-1a136/androidApps/1:279861227938:android:8b4e86b064ce7429c502fb"
        name            = "projects/playground-1a136/androidApps/1:279861227938:android:8b4e86b064ce7429c502fb"
        # (8 unchanged attributes hidden)
    }

  # module.cloud-run-build.google_cloud_run_service.main has changed
  ~ resource "google_cloud_run_service" "main" {
        id                         = "locations/europe-west1/namespaces/playground-1a136/services/playground-service"
        name                       = "playground-service"
      ~ status                     = [
          ~ {
              ~ conditions                   = [
                  ~ {
                      ~ message = <<-EOT
                          - Revision 'playground-service-00817-75n' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                          + Revision 'playground-service-00818-glx' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                          - Logs URL: https://console.cloud.google.com/logs/viewer?project=playground-1a136&resource=cloud_run_revision/service_name/playground-service/revision_name/playground-service-00817-75n&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22playground-service%22%0Aresource.labels.revision_name%3D%22playground-service-00817-75n%22 
                          + Logs URL: https://console.cloud.google.com/logs/viewer?project=playground-1a136&resource=cloud_run_revision/service_name/playground-service/revision_name/playground-service-00818-glx&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22playground-service%22%0Aresource.labels.revision_name%3D%22playground-service-00818-glx%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                        # (3 unchanged attributes hidden)
                    },
                    {
                        message = null
                        reason  = null
                        status  = "True"
                        type    = "ConfigurationsReady"
                    },
                  ~ {
                      ~ message = <<-EOT
                          - Revision 'playground-service-00817-75n' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                          + Revision 'playground-service-00818-glx' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                          - Logs URL: https://console.cloud.google.com/logs/viewer?project=playground-1a136&resource=cloud_run_revision/service_name/playground-service/revision_name/playground-service-00817-75n&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22playground-service%22%0Aresource.labels.revision_name%3D%22playground-service-00817-75n%22 
                          + Logs URL: https://console.cloud.google.com/logs/viewer?project=playground-1a136&resource=cloud_run_revision/service_name/playground-service/revision_name/playground-service-00818-glx&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22playground-service%22%0Aresource.labels.revision_name%3D%22playground-service-00818-glx%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                        # (3 unchanged attributes hidden)
                    },
                ]
              ~ latest_created_revision_name = "playground-service-00817-75n" -> "playground-service-00818-glx"
              ~ latest_ready_revision_name   = "playground-service-00815-znf" -> "playground-service-00817-75n"
              ~ observed_generation          = 817 -> 818
                # (2 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ effective_annotations = {
              ~ "run.googleapis.com/operation-id"   = "e97050f4-92cb-4559-b1e5-9cbdacf93506" -> "83a8b066-10e8-4386-b46d-ede0531a55a6"
                # (5 unchanged elements hidden)
            }
          ~ generation            = 817 -> 818
          ~ resource_version      = "AAYikvuXmnY" -> "AAYipopscbs"
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_firebase_android_app.main will be created
  + resource "google_firebase_android_app" "main" {
      + api_key_id      = (known after apply)
      + app_id          = (known after apply)
      + deletion_policy = "DELETE"
      + display_name    = "Playground"
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + package_name    = "io.ashdavies.playground"
      + project         = "playground-1a136"
      + sha1_hashes     = [
          + "2f50f8fd822a6592508b5adb58a231c729d616a3",
        ]
      + sha256_hashes   = [
          + "2ebfd15ae4682189f047b61a4faa903dc330cbf29b3a21f667595a73fb53a1ff",
        ]
    }

  # module.github-repository.github_actions_secret.main["firebase_android_app_id"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at      = "2023-11-15 19:05:29 +0000 UTC" -> (known after apply)
      ~ id              = "playground.ashdavies.dev:firebase_android_app_id" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-15 19:05:29 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->